---
kind: method
id: M:Autodesk.Revit.DB.Architecture.ContinuousRail.GetSupports
source: html/e966884e-1c38-cb8c-2723-29d8746e5c00.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail.GetSupports Method

Returns all the railing supports attached to the rail.

## Syntax (C#)
```csharp
public IList<ElementId> GetSupports()
```